Tekla Open API Reference for Tekla Structures 2025
CannotPerformOperationDrawingIsActiveException Class
 The CannotPerformOperationDrawingIsActiveException class defines the exception that is thrown when a user tries to do an operation which requires that the drawing is not active.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotPerformOperationDrawingIsActiveException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotPerformOperationDrawingIsActiveException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotPerformOperationDrawingIsActiveException
	Inherits TeklaStructuresDrawingsApplicationException
The CannotPerformOperationDrawingIsActiveException type exposes the following members.
Constructors
Name | Description
CannotPerformOperationDrawingIsActiveException
 Creates a new cannot perform operation drawing is active exception instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace